app/controllers/api/artists_controller.rb

    def index

        if params[:letter]
            @artists = Artist.where("name ILIKE ?", "#{params[:letter]}%")
        else
            @artists = Artist.all
---
SELECT "artists".* FROM "artists" WHERE "artists"."name" BETWEEN $1 AND $2  [["name", "0%"], ["name", "9%"]]
SELECT "artists".* FROM "artists"

    def show
        @artist = Artist.includes(:tracks).find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."artist_id" = $1  [["artist_id", 2]]