app/controllers/api/tracks_controller.rb

    def index
        @tracks = Track.all
---
SELECT  "tracks".* FROM "tracks" ORDER BY "tracks"."id" ASC LIMIT $1  [["LIMIT", 0]]

    def show
        @track = Track.includes(:artist).includes(:annotations).with_attached_image.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "artists".* FROM "artists" WHERE "artists"."id" = $1  [["id", 1]]