app/views/api/artists/show.json.jbuilder

SELECT "tracks".* FROM "tracks" WHERE "tracks"."artist_id" = $1  [["artist_id", 1]]
---
json.tracks do
    @artist.tracks.each do |track|