app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "UTqLAm9tgZ07GPw5NEjvIA"], ["updated_at", "2019-11-05 00:23:52.057535"], ["id", 2]]
---
    def reset_session_token!
        self.update(session_token: SecureRandom.urlsafe_base64(16))